IDEA Open Model
ConcreteCheckResult.CheckResults Property
Compatible with IDEA StatiCa v 10.1
 All results - first is extreme
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public List<ConcreteCheckResultBase> CheckResults { get; set; }
Public Property CheckResults As List(Of ConcreteCheckResultBase)
	Get
	Set
public:
property List<ConcreteCheckResultBase^>^ CheckResults {
	List<ConcreteCheckResultBase^>^ get ();
	void set (List<ConcreteCheckResultBase^>^ value);
}
Property Value
Type: List<ConcreteCheckResultBase>
See Also
Reference
ConcreteCheckResult Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace